export const ur = {
    
    welcome: "لیبر عیز میں خوش آمدید",
    delete: "ختم کریں",
    cancel: "منسوخ کریں",
    submit: "جمع کریں",

    // Home Page
    homePage:{
        servTitP1: "ہالی میں",
        servTitP2: "آئی سروسز",
        des: "لیبر ایزی ہنر مند مزدوروں کو ان لوگوں سے جوڑتی ہے جنہیں ان کی خدمات کی ضرورت ہے۔ ہمارا پلیٹ فارم ہماری تمام خدمات میں معیار اور وشوسنییتا کو یقینی بناتا ہے۔",
        catTitP1: "ہماری سروسز",
        catTitP2: "کے زمرہ",
        headerPara: 'لیبرایز ',
        noData: "...کوئی سروس نہیں ہے",


        // Why Choose US Page
        whyChooseUs:{
            titleP1: "ہمیں کیوں",
            titleP2: "منتخب کریں",
            desc: "لیبرعیز ایک آسان اور قابل بھروسہ پلیٹ فارم ہے جو ہنر مند مزدوروں کو جلدی جوڑتا ہے۔ ہمارا مقصد ہے قابل اعتماد مزدور فراہم کرنا اور انھیں بہتر روزگار دینا ہے۔",
            reason1: "وقت کی بچت",
            reason2: "تصدیق شدہ اور ماہر مزدور",
            reason3: "تیز سروس پروسیسنگ",
            reason4: "مناسب قیمت",
            reason5: "مزدور فوری تلاش کریں",
            reason6: "مزدوروں کی پیشہ ورانہ ترقی",
        },
    },

    // About Page
    aboutPage: {
        titleP1: "ہمارے پروجیکٹں",
        titleP2: "کے بارے ميں",
        heroDescription: "ہمارا پلیٹ فارم محنتی مزدوروں کو گاہکوں سے جوڑتا ہے، محفوظ ادائیگی، معیاری کام اور منصفانہ لین دین کو یقینی بناتا ہے۔ ہم ٹیکنالوجی اور روایتی مہارت کو ایک ساتھ لا کر ایک بہترین تجربہ فراہم کرتے ہیں۔",
      
        visionMissionTitleP1: "ہمارا وژن",
        visionMissionTitleP2: "اور مشن",
        visionMissionDes: [
          "ہم محنتی مزدوروں کو ایک ایسا پلیٹ فارم فراہم کرنے کی کوشش کرتے ہیں جہاں وہ اپنی مہارت کو نمایاں کر سکیں اور ان گاہکوں سے جڑ سکیں جو ان کی خدمات کے متلاشی ہیں۔ ہمارا مشن ایک قابل اعتماد نظام بنانا ہے جو مزدوروں اور گاہکوں دونوں کی حفاظت اور اطمینان کو ترجیح دیتا ہے۔",
          "محفوظ ادائیگی کے طریقوں، شفاف کام کی نگرانی، اور وقف سپورٹ کے ذریعے، ہم اس بات کو یقینی بناتے ہیں کہ ہر خدمت کو پیشہ ورانہ مہارت اور توجہ کے ساتھ سنبھالا جائے۔ ہم روایتی مزدوری اور جدید ٹیکنالوجی کے درمیان خلا کو ختم کرنے کے لیے پرعزم ہیں۔"
        ],
      
        teamTitleP1: "ہماری ٹیم",
        teamTitleP2: "سے ملیے",
        teamMembers: [
            {
                name: "حسن",
                role: "فرنٹ اینڈ ڈویلپر",
                description: "حسن ہمارے ابھرتے ہوئے فرنٹ اینڈ ڈویلپر ہیں، جو ذمہ دار اور آسانی سے استعمال ہونے والے یوزر انٹرفیس تخلیق کرنے میں مہارت رکھتے ہیں۔"
            },
            {
                name: "اويس",
                role: 'ڈویلپر'+' MERN '+'فل اسٹیک',
                description: ' MERN '+'اويس ہمارے ماہر فل اسٹیک ڈویلپر ہیں۔'+'اسٹیک ميں مہارت کے ساتھ، وہ ہمارے پلیٹ فارم کو مضبوط، وسیع اور محفوظ بناتے ہیں۔'
            },
            {
                name: "عاصم",
                role: "مواد لکھنے والا اور ڈیٹا جمع کرنے والا",
                description: "عاصم ہمارے تخلیقی مواد کے ماہر ہیں۔ وہ ضروری ڈیٹا جمع کرتے ہیں اور ہماری منصوبے کی سوچ کو بڑھانے کے لیے مؤثر مواد تخلیق کرتے ہیں۔"
            }
        ],
    },
    
    // Service Page
    servicePage:{
        noService: "...کوئی سروس نہیں ملی",
        header:{
            p1: "اپنی پسند کی",
            p2: "سروس تلاش کریں"
        },
        body:{
            p1: "اپنی پسند کی",
            p2: "سروس منتخب کریں"
        },
        search:{
            filterP1: "سروسز کو",
            filterP2: "فلٹر کریں",
            back: "واپس جائیں",
            clear: "فلٹرز ختم کریں",
            city: "شہر منتخب کریں",
            category: "زمرہ منتخب کریں",
            subCategory: "ذیلی زمرہ منتخب کریں"
        }
    },

    // mainCategories
    mainCategory:{
        cat1:"روزمرہ کی ضروریات کی سروسز",
        cat2:"گاڑیوں کی سروسز",
        cat3:"بیوٹی پالر کی سروسز",
        cat1Des: "روزمرہ کی زندگی میں آپ کی ہر قسم کی گھر یا کسی جگہ کو مرمت کی ضرورت ہوتی ہے۔ جیسے کہ بجلی کا کام، پلمبر، لیبر وغیرہ۔",
        cat2Des: "تمام قسم کی گاڑیوں کی سروسز، بشمول کاروں، موٹر سائیکلوں، رکشوں کی مرمت وغیرہ۔",
        cat3Des: "مردوں اور عورتوں کے لیے تمام قسم کی خوبصورتی کی سروسز، جیسے کہ بالوں کی کٹنگ، دلہن کا میک اپ وغیرہ۔"
    },
    
    // Confirm Dialog
    dialog:{
        accept: "کیا آپ واقعی اس رقیسٹ کو منظور کرنا چاہتے ہیں؟",
        reject: "کیا آپ واقعی اس رقیسٹ کو نامنظور کرنا چاہتے ہیں؟",
        complete: "کیا آپ پیسے دینے کے لیے تیار ہیں؟",
        delete: "کیا آپ واقعی اس کو ختم کرنا چاہتے ہیں؟",
        confirm: "تصدیق کریں",
    },    
    
    // Fields
    fields:{
        name: "نام",
        contact: "موبائیل نمبر",
        address: "کام کروانے کی جگہ (ماکان نمبر وغیرہ)",
        Address: ":جگہ (ماکان نمبر وغیرہ)",
        date: "تاریخ (د ن وغیرہ)",
        city: "شہر منتخب کریں",
        description: "کام کی تفصیل بیان کرے",
        selectTime: " کام کا وقت انتخاب کریں",
        salary: "تنخواہ",
        images: "کام کی تصاویر",
        title: "عنوان",
        category: "زمرہ منتخب کریں",
        subcategory: "ذیلی زمرہ منتخب کریں",
        time: "کام کروانے کا وقت",
        startTime: "آغاز وقت",
        endTime: "اختتامی وقت",
        image: "کام کی تصویر منتخب کریں",
        fixedSalary: "مقررہ تنخواہ",
        salaryFrom: "تنخواہ کی ابتدائی حد",
        salaryTo: "تنخواہ کی آخری حد",
        cnic: "شناختی کارڈ نمبر",
        password: "پاس ورڈ",
        confirmPassword: "پاس ورڈ کی تصدیق",
        changePass: "پاس ورڈ تبدیل کریں",
    },
    
    // Send New Request
    newRequest:{
        title: "نئی درخواست بھیجیں",
        back: "واپس جائیں",
        next: "آگے جائیں",
    },
    
    // Add new Service
    newService:{
        newTitleP1: "نئی",
        newTitleP2: "سروس کارڈ",
        availableTime: "Available Time",
        salaryType: "تنخواہ کی قسم",
        rangeSalary: "تنخواہ کی حد",
        submit: "سروس کارڈ پوسٹ کریں"
    },

    // Worker Panel sidemenu
    sideMenu:{
        dashboard: "ڈیش بورڈ",
        myServices: "میری سروسز",
        serviceRequests: "سروس کی رقیسٹ",
        myProfile: "میری پروفائل",
        logout: "لاگ آؤٹ",
    },
    // Navbar
    navbar:{
        home: 'ہوم',
        about: 'ابائوٹ',
        services: 'سروسز',
        myRequests: "میری رقیسٹ",
    },
    
    // Dashboard
    dashboard:{
        compReq: 'مکمل کی‌ ہوئی رقیسٹیں',
        compReqdes: 'مکمل کیے ہوئے کاموں کا خلاصہ',
        totalReq: 'مکمل کیے ہوئے رقیسٹیں',
        totalBal: 'جمع پونجی',
        recentReq: 'ہالی مکمل کی‌ ہوئی رقیسٹیں',
        noReqComp: 'ابھی تک کوئی رقیسٹ مکمل نہیں ہوئی۔',
        succReq: 'مکمل ہو چکی',
    },

    // My Services
    myServices:{
        titleP1: "میری",
        titleP2: " سروسز",
        addBtn: "نئی سروس بنائیں",
        noService: "آپ نے ابھی تک کوئی سروس نہیں بنائی"
    },

    // My Requests
    myRequests:{
        clientTitleP1: "میری",
        clientTitleP2: "رقیسٹیں",
        workerTitleP1: "سروس کی",
        workerTitleP2: "رقیسٹیں",
        noRequest: "...کوئی رقیسٹ نہیں ملی"        
    },
    

    // Login Page
    login:{
        login: "لاگ ان",
        title: "خوش آمدید",
        des: "اگر آپ ہماری سروسز کے ساتھ جُڑ نا چاہتے ہیں تو لاگ ان کریں اور ہماری سروسز کو دریافت کریں یا اپنی سروسز فراہم کریں",
        forgetPass: "پاس ورڈ بھول گئے؟",
        createAccP1: "اکاؤنٹ بنانا چاہتے ہیں؟",
        createAccP2: "سائن اپ کریں",
    },
    
    // SignUp
    signUp:{
        signUp: "اکائونٹ بنائیں",
        client: "کام دینے والا",
        worker: "کام کرنے والا",
        alreadyAccP1: "اگر پہلے سے اکاؤنٹ ہے تو پلیز ",
        alreadyAccP2: "لاگ ان کریں",
    },

    // Footer
    footer:{
        col1: "شہر میں دستیاب",
        city1: "حیدرآباد",
        city2: "لطیف آباد",
        city3: "پریٹاباد",
        col2: "سروز",
        serv1: "روزمرہ کی ضرورتيں",
        serv2: "گاڑیوں کے مستری",
        serv3: "بیوٹی کیئر",
        col3: "مدد اور سپورٹ",
        help1: "سپورٹ سینٹر",
        help2: "عمومی سوالات (FAQs)",
        help3: "شرائط و ضوابط",
        help4: "پرائیویسی پالیسی",
    },

    // Validations
    validation: {
        required: (field) => `${field} ضروری ہے`,
        minLength: (field, length) => `${field} کم از کم ${length} حروف پر مشتمل ہونا چاہیے`,
        maxLength: (field, length) => `${field} ${length} حروف سے زیادہ نہیں ہو سکتا`,
        invalid: (field) => `${field} غلط ہے`,
        cnicLength: 'شناختی کارڈ نمبر بالکل 13 اعداد کا ہونا چاہیے',
        cnicInvalid: 'غلط شناختی کارڈ نمبر',
        contactStart: 'رابطہ نمبر "03" سے شروع ہونا چاہیے',
        contactLength: 'رابطہ نمبر بالکل 11 اعداد کا ہونا چاہیے',
        reqTime: 'براہ کرم کام کروانے کا وقت منتخب کریں',
        reqDate: 'براہ کرم کام کروانے کی تاریخ منتخب کریں',
        reqSalary: 'براہ کرم کام کروانے کی تنخواہ منتخب کریں',
        password: {
          noSpecial: 'براہ کرم پاس ورڈ میں "." یا اسپیس شامل نہ کریں',
          strength: 'کم از کم 1 چھوٹا، 1 بڑا، 1 نمبر، اور 1 خاص کردار شامل کریں',
          minLength: 'پاس ورڈ کم از کم 8 حروف کا ہونا چاہیے',
        },
        images: {
          required: 'کم از کم ایک تصویر ضروری ہے',
          unsupported: 'غیر معاون فائل فارمیٹ',
          tooLarge: 'فائل کا سائز بہت بڑا ہے (2 زیادہ سے زیادہMB)',
        },
        time: {
          start: 'آغاز کا وقت ضروری ہے',
          end: 'اختتامی وقت ضروری ہے',
          between: (field, start, end) => `${field} ${start} اور ${end} کے درمیان ہونا چاہیے`,
          after: 'اختتامی وقت آغاز کے بعد ہونا چاہیے',
        },
        salary: {
          invalidType: 'تنخواہ کی قسم غلط ہے',
          requiredType: 'تنخواہ کی قسم ضروری ہے',
          min: (field, val) => `${field} کم از کم ${val} روپیے ہونی چاہی`,
          rangeStart: 'تنخواہ کی ابتدائی حد ضروری ہے',
          rangeEnd: 'تنخواہ کی آخری حد ضروری ہے',
          rangeEndGreater: 'تنخواہ کی آخری حد ابتدائی حد سے زیادہ ہونی چاہیے',
        },
    },
}